IdeaRS.Connections
FasteningData.BoltEndOffset Property
Compatible with IDEA StatiCa 0.0
 Timber bolt grid offset from the gusset plate end (end means part of timber gusset plate positioned on the beam)
 Namespace: IdeaRS.Connections.Data
 Assembly: IdeaRS.Connections (in IdeaRS.Connections.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double BoltEndOffset { get; set; }
Property Value
Type: Double
See Also
Reference
FasteningData Class
IdeaRS.Connections.Data Namespace